_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 28, 28, 1)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 784)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 3456)              2712960   
_________________________________________________________________
batch_normalization_1 (Batch (None, 3456)              13824     
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 3456)              0         
_________________________________________________________________
reshape_1 (Reshape)          (None, 3, 3, 384)         0         
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 7, 7, 192)         1843392   
_________________________________________________________________
batch_normalization_2 (Batch (None, 7, 7, 192)         768       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 7, 7, 192)         0         
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 14, 14, 96)        460896    
_________________________________________________________________
batch_normalization_3 (Batch (None, 14, 14, 96)        384       
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 14, 14, 96)        0         
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 28, 28, 1)         2401      
=================================================================
Total params: 5,034,625
Trainable params: 5,027,137
Non-trainable params: 7,488
_________________________________________________________________
